from sistdmyy import db 
from sistdmyy.dz import mine 
import pandas as pd 
import jieba 
import re




#std用于将一个地址分割

'''需要dz_dz  dz_qh dz_jd 三张表
spl(a) 分解深圳市福田区莲花街道北环大道7045号哈尔滨大厦1-07 成一个dick
但是要注意一个词典的问题
loadword()是切换成 dz_dz的词
这不是做好的设计，此处将来可能要改成,self.words self.word2s分开，切换动作单独做成一个函数

std类是运用得到的语料将地址标准化
初始化sql,决定需要处理的df  ztsfdm-jgdz
'''





class std:
    def __init__(self,sql=None,df=None):
        self.m1=db()
        self.m2=mine()
        self.initdf(sql,df)
        self.loadword()
        self.dzdict()
    def initdf(self,sql,df):
        if sql is None:
            sql="select top 10000 ztsfdm,jgdz from basedb.dbo.t_zzjgjz where jglxdm in('1','2') and ztztdm>=0 and clrq>='2017-01-01' "

        if df is None:self.df=self.m1.frommssql(sql)
        else: self.df=df

    def dzdict(self):
        sql="select word,tag from test_dmyy.dbo.dz_dz "
        self.dftz=self.m1.frommssql(sql)
        self.dz={self.dftz.iat[i,0]:self.dftz.iat[i,1] for i in range(len(self.dftz))}
        self.dz_tagset=set(self.dftz['tag'].unique())


    def loadword(self):
        '''需要dz_dz  dz_qh dz_jd 三张表'''
        df=pd.DataFrame()
        sql="select word from test_dmyy.dbo.dz_dz"
        df=df.append(self.m1.frommssql(sql))
        for w in ['qh','jd']:
            sql="select word from test_dmyy.dbo.[dz_%s]"%w
            df=df.append(self.m1.frommssql(sql))
        self.words=set(df['word'])
        for w in self.words:
            jieba.add_word(w)

    def extr(self,a):
        a=self.m2.clear(a)
        return ','.join(filter(lambda x:x in self.words,jieba.cut(a)))

    def spl(self,a):
        dic=filter(lambda x:x in self.words,jieba.cut(a))
        d={self.dz[w]:w for w in dic if w!=''}
        for w in self.dz_tagset:
            if w not in d.keys():d[w]=None
        return d
    def tb1(self):
        df=self.df
        self.df=df1=pd.DataFrame(list(map(lambda i:dict(self.spl(df.at[i,'jgdz']),**{'jgdz':df.at[i,'jgdz'],'ztsfdm':df.at[i,'ztsfdm']}),df.index)))
        print('tb1完成')
        return df1


    def loadword2(self):
        a=['峰荟时代科技中心','路港之龙商务中心','大冲商务中心','梅花山庄欣梅园','东方盛世','富基国际','阳光天地明星阁'
        ,'龙园山庄','1980文化创意园','信义六期溢芳园','上塘松仔园','飞马城皮革市场','锦绣御园','银科大厦','国际贸易中心大厦'
        ,'九星号工业园','风临国际','泰美珠宝园','华强电子世界','牛地埔美满园','上梅林文体中心','泰美珠宝园','现代之窗'
        ,'嘉龙山庄','光浩国际中心','海尚国际丰润阁','福森商务中心','香蜜湖体育中心','OTO创客中心','华利嘉电子市场','百合盛世'
        ,'硅谷动力数码产业园','翠馨居','大学城创业园','设计之都创意产业园','太阳新城','里仁府','清湖农贸批发市场','郁金香家园枫丹堡'
        ,'鼎太风华','华富电子城','春华四季园','海境界家园','宇丰综合楼','万科金域缇香一期','喜年中心','星际家园','三和国际城','欢乐海岸购物中心'
        ,'百合星城','汇亿财富中心','丹枫白露城','铭乐公寓','深圳软件园','道梅花山庄思梅园','群丰工业区','笋岗仓库','东江环保工业城'
        ,'上雪科技工业城','西城丰和','深圳集银皮革综合广场','1980创意文化产业园','深圳国际软件园','龙岗创新产业园','兴达华府'
        ,'富通好旺角','鹤州恒丰工业城','百门前工业区','学山工业园','和雅商大酒店','华源商务中心','旭飞华达园','风门坳工业','西岸华府'
        ,'丰润楼','龙胜科技楼','盛世江南','怡枫园','红湾商务中心','秀峰工业城','智汇创新中心','恒通工业城','赛龙豪轩','丰和园','鼎诚国际'
        ,'云顶翠峰','力缆科技','智恒产业园','福兴达物流园','华南城','宝安新一代信息技术产业园','漾日湾畔','厦门大学龙华产学研基地'
        ,'中国地质大学','宏昌华府','聚豪国际','新天商务中心','宝安互联网产业基地','华联发综合楼','飞扬时代','南海意库','大冲国际商务中心'
        ,'田厦IC产业园','金碧世家','幸福华府','中海阅花园','华达园二期','馨园二期','富通蟠龙居','龙璧工业城','黄埔综合楼','世纪春城'
        ,'越众越海家园','阳光新境园','咏辉沙井工业城','中兴工业城','佳兆业大都汇','白金时代','海典居','福宇轩','水榭春天六期','中海康城国际二期'
        ,'李朗珠宝产业园','振业恋山谷花园','椰风海岸','龙峰庄','坂田手造文化街','金鹏物流园','南方明珠商业城','凤天创新科技产业园','金民安酒店'
        ,'万山珠宝园','丹竹头恩来工业城','幸福里','中海大山地','马家龙田厦产业园','金域豪庭','国雄楼','127陈设艺术产业园','麒裕工业城'
        ,'林荣综合楼','锦绣江南','世界金融中心','香蜜湖花卉中心','天越翔园','桑达电子通讯市场','上李朗统建楼','金运家园','坂田国际中心'
        ,'华强光场','天安数码创新园','新天CBC世纪商务中心','核工华南工贸园','卓越城一期','华通源物流中心','高科德电子市场','1980文化产业园'
        ,'天悦龙庭','大华飞捷工业城','荷兰花卉小镇','横岭恒润小居','绿海名都','潜龙景园','阳光天地家园','华创达文化科技产业园','宝源居'
        ,'青年城邦园','桃源盛世园','九州家园一期','南易晟大厦','南景豪庭','华盛辉综合楼','彩虹新都','合正锦湖逸园','祥和山庄','凤凰世纪'
        ,'美兰国际商务中心','新梅子园','绿景山庄','裕康时尚名居','西城品阁','栖游家园','华创达文化产业园','山美新村大厦','君荟时尚公寓'
        ,'汇聚创新园','华府国际','阳光天地','世外桃园创意园','侧富瑰园','明君商务中心','宝立方','文谷庄园','长景阁','深圳软件产业基地'
        ,'景乐市场','金庸阁','丰路富生集团','都汇中心','碧海富通城','创兴时代','美丽家园','凤凰名居','华美居','华景乐园','1980文化创意产业园'
        ,'茗萃园一期','润迅工业园','德普电子市场','华南物流园','龙胜配件城','瑞峰创业中心','宝利豪庭','华丰商贸城','信义御城','硅谷动力射频科技园'
        ,'都会100','海鹰大夏','大芬油画街','卓越世纪中心','南山农批市场','万科翰邻城','六约珠宝文化产业园','碧湾雅园','泊林国际珠宝交易中心'
        ,'名豪丽城','金色阳光雅居','龙腾阁','碧湾雅园','金積嘉科技园','雷圳碧榕湾','水斗嘉辉商务中心','璟隆商务中心','东方明珠城','沙园圃大厦'
        ,'宝港中心','金和瑞颐泉工业区','招商澜园','信义假日名城','新亚洲电子市场','恒润小居','恒福居','珠江国际中心','田厦翡翠明珠写字楼','中粮锦云商务楼'
        ,'桂芳园一期','明月花都','互联网产业基地','慧华园富士康','国际珠宝交易中心','白金国际茶都','皇庭香格里','水榭春天','明月花都','花样年花乡家园'
        ,'田厦国际中心','东方国际','金色都汇金运阁','天景山庄','懿花园','聚龙华府','桂木坊','华丰锦源商务大厦','湖景居','滢水山庄','碧湖玫瑰园'
        ,'宝运达物流中心','明金海综合楼','梅花新园','龙湖山庄','前海湾汽车物流园','同富裕','汇源豪庭','海心汇福园','华茂欣园','赛格通讯市场','观海台'
        ,'艺展中心一期','桃源居','龙岭山庄','九州家园','创富时代','清湖铭泉','缔梦园丽梦轩','红荔路花卉世界','一本电子商务产业园','笋岗商业仓库'
        ,'南岭桂芳园','湖贝西坊','新锦安雅园','宝源路名优','学府路软件产业基地','泛海拉菲一期','福民路汇商中心','中海阳光玫瑰园','香蜜湖文化风情街'
        ,'南海玫瑰园二期','金地名津','丽景城','万象天成','满京华喜悦里','恩来工业城','君逸华府','北方骏亿商务中心','卓越城','深圳文化创意园','星河world'
        ,'雍华源','创客小镇','未来时代主体檐廊','香林世纪华府','田厦翡翠明珠','奥林华府二期','宝荣电器城','中康创业园','桃源盛景园','宝安电子数码城'
        ,'深港花卉中心','泉森创业园','宝能宝钜','东环一路国际电子城','河东骏丰园','布吉路海鲜市场','万科金色家园一期','泰华阳光海','智慧创新中心'
        ,'缤纷世纪公馆','东苏豪名厦','君逸世家','峦山谷二期','海天一路软件产业基地','银龙工业城','曦湾华府','坂田创意园','东湖路彩世界','翠景居'
        ,'缤纷年华','金成时代北京居','盛世家园','世纪华厦','诗宁里','元升物流园','金浩源电商产业园','深业新岸线','名仕国际','U创谷','风临四季'
        ,'鸿景园','翠枫豪园二期','名优工业产品展示采购中心','凤凰雅居','爱国路天井湖','信和爱琴居','凤门园工业园','红音阁','坤宏工业区','深业世纪中心'
        ,'德普沙井电子市场','艺茂中心','绵商西乡青年创业园','悠然居','珠光路花半里','万科东海岸3期','鹏兴居','华达园','万科翡丽郡二期','巾帼文明创业街'
        ,'广兴源互联网创意园','贤机大厦','华强国际创客中心','米兰寓所','御景华城','时尚创意园','鹏荣货运中心','中加名园','北跃华园','德意名居'
        ,'朗麓家园','新亚洲电子商城二期','水斗新围','金莎花园','中海怡美山庄','龙岗高新技术园','冠城世家','龙胜市场','软件园二期','华盛辉','石路超工业园'
        ,'富通天骏','宝福珠宝园','南园丽苑','嘉辉商务中心','颐林雅院','天安数码城','中山大学深圳产学研大楼','世纪汇都会轩','海岸时代','鸿隆世纪','鹿鸣园紫桑庭'
        ,'海雅缤纷城','艺览中心','豪亭阁','嘉汇新城','振业峦山谷','名苑居','永丰综合楼','夏翡翠明珠','国际商品交易大厦','圣佑治工业园','峰景台庐山阁','时尚新天地名苑'
        ,'锦文阁','倚天阁','首创八意府','中信红树湾花城','沙井青年创业中心','中建工业园','恒裕中心','路金龙工业城','共发达物流中心','绿色家园','清湖农批市场'
        ,'新天地名居','佳兆业中心','慧华园','如意家园','缔梦园','育德佳园','幸福城1期','中洲一期','清华大学研究院大楼','景民新城','半岛城邦二期','南国丽园'
        ,'荣超经贸中心','红桂皇冠名庭','融域名城','星海名城一期','科兴科学园','中海锦城','汇聚创意园','富瑰园','翡翠星光园','第五电子产业园','益华电子批发市场'
        ,'汇通安防数码港','星海名城七期','鹏荣物流园','新浩壹都','锦丰公司','新都宾馆','天一名居','南山区电子商务创新服务基地','世外桃源创意园','文景广场'
        ,'宝安互联产业基地','聚宝华府','美丽AAA','东海国际中心','太阳能硅谷','黄金豪庭','世界国际金融中心','山海津','章阁中心城','华通源物流园','赛格电子市场'
        ,'碧海红树园','万科城雍地轩','天健时尚新天地','劲力城市明珠','众鑫科大厦','国际电子商务产业园','新天下工业城','可园','桦润馨居','大鹏海鲜世界'
        ,'中投国际商务中心','莲花阁','嘉信蓝海华府','阳光荔景','高新技术产业园','美兰商务中心','宝德工业中心','鑫茂写字楼','日豪名园','华强创意产业园'
        ,'京基卸景印象二期','嘉洲豪园二期','中航天逸','新中泰文化创业园','南瑞峰','观湖园','深华丽园','花里林居','富源商贸中心','电子商务创新服务基地'
        ,'景湖家园','金港豪庭','尚时代园','华丰商务中心','航山月名园','海岸城','蚝二西海岸豪庭','智谷产业创新园','万科红三期','石材市场','科技园软件产业基地'
        ,'城市山谷','TCL多媒体大厦','中粮福安智汇创新园','星光美食街','鸿翔家电商创业园','中海康城国际','鹏基商务时空大厦','新亚洲二期','太平洋安防市场'
        ,'豪庭商务中心','富盈门花园','东华园','新世界中心','西朗晴馨洲','名骏豪庭','南山互联网创新创意服务基地','花样年花郡','明通数码城','东方沁园二期'
        ,'中铁南方总部大厦','华创达商务楼','圣淘沙骏园','鹊山新村工业园','生科南大厦','新村大厦','外贸大院','阳光绿地家园','宁泰花园','新岭山庄','华深办公楼'
        ,'碧中园碧天阁','新岭山庄','阳光绿地','碧中园碧云阁','外贸轻工大夏','锦秀新居','麒通天配件市场','通天地长城市场','统建手机市场','好天地通讯市场'
        ,'爱华路锦绣新居','长城通讯市场','爱华大院','锦绣新居','湛江楼','龙城华府','熙和园','嘉豪何室','启正源商务中心','同富康科技创新园','爱榕园','兰园一街'
        ,'翠薇园','雍景湾','万科翰林城','熙和园','宝明商务楼','瑞泽佳园','深圳书城中心城','现代演艺中心','园岭一街','凯旋豪庭','红荔路花卉市场','处香榭茗园'
        ,'现代教育城','第壹世界','群星大厦','金色假日','玫瑰阁','花卉世界美丽园','凯旋豪庭','红荔西路花卉世界','福田花卉世界','莲花山花木园','香雅阁'
        ,'联合华鹏汽车广场','红荔西路市政大院','聚豪园怡乐阁','梅园仓库','金祥悦园','京基百纳','京基一百','滨苑','京基晶都','美荔园','建设集团大院'
        ,'路瑞泽佳园','振业城二期','锦冠华城','金山园物流园','英达利科技数码园','丽晶中心','189工业区','黑与白大厦','时尚E城','时尚e城','景冠华城'
        ,'明华中心','海伴雅居','荣村工业厂房','荣村工业区','互联网创新创意基地一期','汉永楼','裕华园','福满楼','万福科创中心','智汇创新园','北方俊億工业园'
        ,'润恒鼎丰高新产业园','航盛工业区','福鑫商务中心','领航物流园','新世界商务中心','诺德金融中心','诺德中心','福海信息港','同创新作','熙璟城','广弘星座'
        ,'桂盟工业园','广州军区大楼','笋岗工艺城','远望二手车市场','笋岗文具批发市场','华海达国际服装交易中心','家之福博览中心','满京华艺展一期'
        ,'华海达国际服装城','好百年','艺展中心二期','华海达综合楼','艺展一期','岗物流园','万科金色领域','红湾创客中心','鸿荣源禧园','益华电子城','新中泰商务中心'
        ,'航城钢材交易中心','麒麟名都','禧园花园','嘉进隆前海汽车城','荣泰园','星河世纪','嘉麟豪庭','大中华新天地','诚发工业厂区','金湖山庄','金湖一街'
        ,'湖国际会议中心','润唐山庄','齐明别墅','鸣翠谷','合欢商业中心','小时代偶寓','麒裕工业园','侨鸿盛文化产业园','智谷创新园','招商果岭','智谷科技创新园'
        ,'润恒尚园','碧海君庭','城市峰尚','玉壶湾','招商果岭','华丽中心','沁园','满京华','蓝湾家园','民治商务中心','1980创意产业园','1980创业文化产业园','1980产业园'
        ,'1980创意文化园','1980文创园','思梅园','梅花山庄','1970文化创意产业园','粤通综合楼','绿景佐阾香颂购物中心','粤通综合楼','华通物流园','富威大厦'
        ,'民治天虹','新庄园','绿景香颂','万众城','民乐山庄','咏梅园','威化大厦','悦湖商住楼','民乐翠园','吉盛楼','濠景时代','濠景城','民主丰泽园','百利西城'
        ,'丰泽园','海欣楼','花样年花乡','花样年花港家园','泊郡雅园','绿色盐港家园','沙河观景阁','龙珠车场','百威年','龙都名园','俊峰丽舍','郁金香','宝大洲厂房'
        ,'龙珠三路一通二手车','光前村综合楼','龙珠三路桃源二手车','龙珠三路一通','金谷创业园','明雅二手车交易中心','明雅二手车市场','怡然天地','怡然天地居','龙珠五路城市假日'
        ,'西丽体育中心','高新奇战略新兴产业园','美生创谷科技创新园慧谷','星河COCO Park','COCOPARK','同方信息港','紫光信息港','清华信息港','华瀚创新园'
        ,'航空电子工程研发大厦','青年梦工场','奔霓诗工业厂区','大浪时装创意城','新围万联','宝捷安经贸中心','宝捷安商务中心','星海名城','阳光棕榈园'
        ,'振业国际商务中心','南山花卉世界','新德家园','诺德国际','太子山庄','前海明珠','前海路花卉世界','海大创意园','亿利达创世纪商务中心','跃华园'
        ,'中兴之家','好来居','南园公寓','南海城中心','南山文体中心','馨荔苑','南头仿古城','光彩新天地','悠然天地家园','道阳光雅宛大厦','彩虹之岸'
        ,'深圳湾科技生态园','研祥智谷中心','缘来居','长园新材料','易事达宝益成科技园','荣村工业园','联合工业村','海昌街','合正汇一城','绿海名居'
        ,'西部开发区光汇集团工业园','新亚洲电子商城','高科德','富怡雅居','万科第五园','城建综合楼','华盐宾馆','钰田珠宝交易中心','金翠园','佳兆业金翠园'
        ,'英丽阁','纺织大院','雍翠华府','松泉山庄','百仕达三期','彩宝基地','威商流E城','云谷二期','桑泰丹华府','愉盛股份合作公司综合楼','泰华俊庭','富源海宾大厦'
        ,'硅谷动力新材料产业园','盈富家园','望牛岗','燕子岭生活区','燕子岭配套生活区','豪方菁园','雕塑家园','香瑞园','金湖文化中心','合正园','名仕春天'
        ,'银湖山庄','汇尚厦','创谷大厦','宝路科技园','信达科技创意园','晖信综合楼','信达创意产业园','百佳润商务中心','路旺业工业厂区','蚝乡路中心名座'
        ,'华盛盛荟名庭','雅豪轩','华润馨居','龙华iCO商场','龙华ICO商场','粤商中心','百富汇装饰材料城','百富汇装饰城','东华明珠园','花好园','光华园','京基滨河时代'
        ,'花样年花好园','文汇农贸市场综合楼','建安路综合楼','风尚时代','马古岭','万山珠宝交易中心','万山商业中心','如意豪庭','君悦豪庭','奥林华府','富通城'
        ,'御龙居','天琴阁','彭年写字楼','海燕大酒店','爵士大夏','阳光酒店','东家大厦','华丰新安创业基地','华丰青年创业孵化基地','金汇名园','华丰新安青年创业基地'
        ,'华丰青年创业基地','万家灯火','星河雅宝','溪山美地园','星河WORLD','滢山庄','荣裕发商业城','宏发田寮物流园','南安科技园','南园枫叶','南浦街','头城商业街'
        ,'设计产业园金栋','时代骄子','万象新园','美丽湾广场','深圳证券交易所广场','大中华国际金融中心','联合华鹏汽车交易广场','南山软件园','数字文化产业园','数字文化产业基地'
        ,'东海国际','东方银座','骏泰豪商务中心','鸿德园','红音搁','恒光耀工业厂区','碧水龙庭','樟坑一区','樟坑三区','星河盛世','京基凤凰印象','凤凰印象','京达酒店'
        ,'京达会所','凤凰街','金城花庭','凰山大道美食街','福永钢材批发市场','阳光天健城','家乐园建材市场','龙岗天安数码创业园','家乐园花卉中心','宝昌利工业厂区'
        ,'龙华文具批发城','上水径综合楼','红门科技园','上雪科技城','布吉义务商品城','嘉御豪园','红门工业园','德兴城','新天下华赛工业厂区','华业玫瑰郡'
        ,'余岭山庄','公园大地','友和国际酒店','鸿基风临域','亚优特科技园','天安国际','嘉里中心','黄金海岸','溢丰楼','帝港海湾豪园','裕安综合市场'
        ,'自由路新天地','怡富楼','坂田高新技术园','高新技术科技园','中海日辉台','宏汇阁','和润家园','诚达和园','中洲中央公园','勤诚达和园','和园停车场'
        ,'尚美中心','新中泰','时代科创中心','万象新天','宝安钢材市场','企拓商务','香格丽湾园','华宏工业园','恒昌荣高新产业园','塘西商务楼'
        ,'国威公司工业厂房','雍翠豪园','莲馨园','恒得源工业城','同安物流园','通城商务中心','佰益达科技楼','金水湾御园','中核集团厂房','振业城'
        ,'创业壹号大楼','华彩大厦','雍景轩','创意产业园','玫瑰园','元征科技厂区','金方华电商产业园','和成世纪名园','和成世纪中心','鸿盛大厦','和成世纪'
        ,'光雅园','信义嘉御山','港隆城','骏皇名居','雄光大厦','吉星国际农产品物流园','绿色公寓','荣超国际商会中心','华丰新安青年创业孵化基地'
        ,'熙龙湾二期','友联船厂','沙民股份公司工业区','国际名园','国香尚居','友谊城','阳光小城','君悦龙庭','汇一城','999大酒店','古玩城','爱华统建市场'
        ,'瑞思国际','京基金融中心','坤联楼','金色家园','鹤洲豪庭','梅林办公楼','苏豪名大厦','苏豪铭厦','阳光新居','李朗国际珠宝园','中盈珠宝工业厂区'
        ,'宝鼎威物流园','巨银科技工业厂','荔景商务','深港一号','深港1号','公路大厦','彩云居','福围路商业街','双御雅轩','英龙商务中心','中泰燕南名庭'
        ,'顺泰商务中心','华南国际印刷纸品包装物流区','中联通泰橡胶工业园','茗翠园','斌城物流园','上品雅园','康乐通信市场','锦星楼','云景豪园','锦星别墅'
        ,'新天世纪商务中心','恒丰工业城','富源工业城','深业世纪工业中心','鼎尚时代','鼎盛创意园','布龙城','十二橡树庄园','万科麓城','中海怡翠山庄','中裕冠工业区'
        ,'御峰园','万科东海岸','天安云谷','龙园意境','华浩源','怡瑞山居','百花二街','长兴楼','龙翔山庄','光明高科技农业产业园综合楼','万科金域','大东城','金域缇香'
        ,'兴鸿基物流园','兴围物流中心','兴鸿基物流园','君悦阁','汽车大院','老虎坑环境园','星城购物中心','瓦特斯','榆峰工业','莱纬斯工业厂房','华美街','骏龙达建材市场'
        ,'丽港湾丽湾阁','保利上城','龙海家园','怡景路景贝','名家富居','华为坂田基地','艺赏中心','艺展中心','金汇雅园','中裕冠产业园','丰泽湖山庄','天居水木澜山居'
        ,'华安园','多丽产业园','梅沁楼','碧华庭居碧园','凯利昇','深峰路工业区','大冲国际中心','华丽园','锦田湾','青春庭园','中熙ECO国际','路老兵工业城','国汇通商务中心'
        ,'T6艺术','欣旺达电子工业园','设计之都','京基御景印象','金星辉电子城','金茂礼都','时代中心'
        ]

        self.word2s=set(a)
        for w in self.words:jieba.del_word(w)
        for w in self.word2s:jieba.add_word(w)

    def spl2(self,a):
        x=list(filter(lambda x:x in self.word2s,jieba.cut(a)))
        return x[0] if x!=[] else None

    def tb2(self):

        self.loadword2()
        df=self.df

        df1=df[['jgdz']].loc[df['楼群'].isnull()].applymap(self.spl2)
        df.loc[df1.index,'楼群']=df1['jgdz']
        print('tb2完成')
        return df
    def tb3(self):
        df=self.df
        df['路道街扩展']=None
        for i in range(len(df)):
            a,b=df.at[i,'jgdz'],df.at[i,'路道街']
            a=self.m2.clear(a)
            pt=['%s[0-9一二三四五六七八九十零A-Za-z\-、]+[巷栋室楼区号]{1}|%s[0-9一二三四五六七八九十零A-Za-z\-、]+$'%(b,b),
                '%s[0-9一二三四五六七八九十零A-Za-z\-、]+小区'%b,
                "(%s)(?:向*[东南西北]+恻*)([0-9一二三四五六七八九十零A-Za-z\-、]+[巷栋室楼区号]{1})"%b,
                
                "%s.{1,2}段[0-9一二三四五六七八九十零A-Za-z\-、]+[巷栋室楼区号]{1}"%b
            ]
            for w in pt:
                c=re.findall(w,a)
                if c !=[]:
                    df.at[i,'路道街扩展']=''.join(c[0])
                    continue
        print("tb3完成")
        return df[~df['路道街扩展'].isnull()]
    def tb4(self):
        df=self.df
        df['村社镇扩展']=None
        for i in range(len(df)):
            a,b=df.at[i,'jgdz'],df.at[i,'村社镇']
            a=self.m2.clear(a)
            pt=[
            '%s[0-9一二三四五六七八九十零A-Za-z\-、]+[巷栋室楼号区坊]{1}|%s[0-9一二三四五六七八九十零A-Za-z\-、]+$'%(b,b)
            ]
            for w in pt:
                c=re.findall(w,a)
                if c !=[]:
                    df.at[i,'村社镇扩展']=''.join(c[0])
                    continue
        print("tb4完成")
        return df[~df['村社镇扩展'].isnull()]
    def tb5(self):
        #龙华办事处 转换成龙华街道
        pass
    def tb(self):
        self.tb1()
        self.tb2()
        self.tb3()
        self.tb4()
        self.tb5()
